-*- mode: org; mode: visual-line; -*-
#+STARTUP: indent
#+PROPERTY: header-args:emacs-lisp :results output silent
#+PROPERTY: header-args:clojure :results value verbatim replace
#+PROPERTY: header-args :exports none

* Testing Clojure

Start a Clojure session in the usual way, via ~M-x cider-jack-in~.

Here's a quick test. In this block, type ~C-c C-c~ to execute the code, or type ~C-c \acute{}~ to open a custom editor session for the block, with the usual Clojure editing tools.

#+BEGIN_SRC clojure
  (range 10)
#+END_SRC

#+RESULTS:
: (0 1 2 3 4 5 6 7 8 9)

Since a single Clojure session underlies Babel, all blocks share the same environment:

#+BEGIN_SRC clojure
  (def A (range 10))
#+END_SRC

#+RESULTS:
: #'user/A

#+BEGIN_SRC clojure
A
#+END_SRC

#+RESULTS:
: (0 1 2 3 4 5 6 7 8 9)

* ClojureScript, Figwheel and Chestnut

To start the Figwheel server:

#+BEGIN_SRC clojure
  (run)
#+END_SRC

#+RESULTS:
: nil

To switch from Clojure to ClojureScript:

#+BEGIN_SRC clojure :results output verbatim
  (browser-repl)
#+END_SRC

#+RESULTS:
#+begin_example
Launching ClojureScript REPL for build: app
Figwheel Controls:
          (stop-autobuild)                ;; stops Figwheel autobuilder
          (start-autobuild [id ...])      ;; starts autobuilder focused on optional ids
          (switch-to-build id ...)        ;; switches autobuilder to different build
          (reset-autobuild)               ;; stops, cleans, and starts autobuilder
          (reload-config)                 ;; reloads build config and resets autobuild
          (build-once [id ...])           ;; builds source one time
          (clean-builds [id ..])          ;; deletes compiled cljs target files
          (print-config [id ...])         ;; prints out build configurations
          (fig-status)                    ;; displays current state of system
  Switch REPL build focus:
          :cljs/quit                      ;; allows you to switch REPL to another build
    Docs: (doc function-name-here)
    Exit: Control+C or :cljs/quit
 Results: Stored in vars *1, *2, *3, *e holds last exception object
Prompt will show when Figwheel connects to your application
To quit, type: :cljs/quit
#+end_example

Note: this requires a browser to be running and connected to ~http://localhost:3449~.

And back:

#+BEGIN_SRC clojure :results output silent
:cljs/quit
#+END_SRC

To see which environment we're currently in:

#+BEGIN_SRC clojure :results value verbatim
  #?(:clj  (str "Clojure @ " (java.util.Date.))
     :cljs (str "ClojureScript @ " (js/Date.)))
#+END_SRC

#+RESULTS:
: "ClojureScript @ Wed May 18 2016 15:52:17 GMT+0100 (BST)"

